app/Http/Controllers/OrderController.php

    public function index(Request $request)
    {
        $this->migrateStatuses();

        $restorants = Restorant::where(['active'=>1])->get();
---
select * from `restorants` where (`active` = 1)

    public function dashboard(Request $request)   {


       //Get client's orders
        if (auth()->user()->hasRole('client')) {
           return redirect()->route('orders.index');
        ////Get driver's orders
        } elseif (auth()->user()->hasRole('driver')) {
            return redirect()->route('orders.index');
        }

        $this->migrateStatuses();

        $restorants = Restorant::where(['active'=>1])->get();
---
select * from `restorants` where (`active` = 1)